[MZFireThrower X2AbilityTemplate]
LocFriendlyName="Fire Immolator"
LocLongDescription="Expel a stream of highly flammable chemicals, burning and damaging multiple targets."
LocHelpText="Expel a stream of highly flammable chemicals, burning and damaging multiple targets."
LocFlyOverText="Fire Immolator"
LocPromotionPopupText="<Bullet/>Expel a stream of highly flammable chemicals, burning and damaging multiple targets."

[MZFireThrowerOverwatchShot X2AbilityTemplate]
LocFriendlyName="Immolator Overwatch Shot"
LocFlyOverText="Immolator Overwatch Shot"

[MZBurningRush X2AbilityTemplate]
LocFriendlyName="Burning Rush"
LocLongDescription="Activate to gain a movement AP, and basic Chemthrower attacks will not use up all AP this turn."
LocHelpText="Activate to gain a movement AP, and basic Chemthrower attacks will not use up all AP this turn."
LocFlyOverText="Burning Rush"
LocPromotionPopupText="<Bullet/>Immediatly grants a bonus action point that can be used for movement.<br/><Bullet/>Chemthrower basic attacks will not end the turn on the turn this is activated.<br/><Bullet/>Has a <Ability:BURNINGRUSH_COOLDOWN> round cooldown.<br/><Bullet/>Costs <Ability:BURNINGRUSH_AMMO> Ammo.<br/><Bullet/>Can only be activated if the <Ability:ClassName/> will still have enough ammo to fire after moving."

[MZChemicalDeflector X2AbilityTemplate]
LocFriendlyName="Chemical Deflector"
LocLongDescription="The <Ability:ClassName/> gain immunity to the damage types of the equipped Chemthrower and Canister."
LocHelpText="The <Ability:ClassName/> gain immunity to the damage types of the equipped Chemthrower and Canister."
LocFlyOverText="Chemical Deflector"
LocPromotionPopupText="<Bullet/>Grants immunity to the damage types of the equipped Chemthrower and Canister."

[MZChemicalDeflectorSquad X2AbilityTemplate]
LocFriendlyName="Chemical Bastion"
LocLongDescription="Chemical Deflector also provides the same immunities for the <Ability:ClassName/>'s squadmates if they are within range."
LocHelpText="Chemical Deflector also provides the same immunities for the <Ability:ClassName/>'s squadmates if they are within range."
LocFlyOverText="Chemical Bastion"
LocPromotionPopupText="<Bullet/> Grants immunity to the damage types of the equipped Chemthrower and Canister. <br/><Bullet/> Has a range equivelent to the chemthrower's maximum length, which can be improved with a high velocity nozzle.<br/><Bullet/> Only benefits soldiers that are present when the <Ability:ClassName/> begins play."

[MZChemthrowerKillZone X2AbilityTemplate]
LocFriendlyName="Valley Of Death"
LocLongDescription="Take a reaction shot against any enemy that moves or attacks within a cone of fire. Each attack can hit multiple targets."
LocHelpText="Enhanced overwatch in a cone of fire."
LocFlyOverText="Valley Of Death"
LocPromotionPopupText="<Bullet/> There is no limit to the amount of Valley Of Death shots a <Ability:ClassName/> can take outside of ammo counts.<br/><Bullet/> Each Valley Of Death shot damages multiple targets in a cone, making it extremely effective against swarming enemies.<br/><Bullet/> Valley of Death has a <Ability:SelfCooldown/> turn cooldown.<br/>"
LocFriendlyNameWhenConcealed="Valley Of Death (Concealed)"
[MZChemthrowerKillZoneShot X2AbilityTemplate]
LocFriendlyName="Valley Of Death"
LocFlyOverText="Valley Of Death"

[MZChemthrowerSuppression X2AbilityTemplate]
LocFriendlyName="Chemthrower Suppression"
LocLongDescription="Pins down a target with continous fire from the <Ability:ClassName/>'s Chemthrower, granting reaction fire against it if it moves, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to the target's aim."
LocHelpText="Penalize target's aim and shoot them if they move."
LocFlyOverText="Chemthrower Suppression"
LocPromotionPopupText="<Bullet/> Suppression costs <Ability:SelfAmmoCost/> ammo points to use, but has no cooldown.<br/><Bullet/> The reaction does not require any additional ammo.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> Will damage multiple targets in a cone, if they're nearby when the primary target moves.<br/><Bullet/> Bonus effects from chemthrowers are applied immediatly.<br/><Bullet/> The reaction shot has reduced penalties from enemy cover, making it a good choice to use against entrenched foes.<br/>"

[MZChemstorm X2AbilityTemplate]
LocFriendlyName="Chemical Storm"
LocLongDescription="Unlock a special Chemthrower attack that affects a complete circle around the <Ability:ClassName/>'s position."
LocHelpText="Unlock a special Chemthrower attack that affects a complete circle around the <Ability:ClassName/>'s position."
LocFlyOverText="Chemical Storm"
LocPromotionPopupText="<Bullet/>Unlock a special Chemthrower attack that affects a complete circle around the <Ability:ClassName/>'s position.<br/><Bullet/>Costs <Ability:CHEMSTORM_AMMO/> Ammo.<br/><Bullet/>Has a <Ability:CHEMSTORM_COOL/> round cooldown.<br/><Bullet/>Has a range of <Ability:CHEMSTORM_RADIUS/> tiles.<br/>"

[MZChemstormFire X2AbilityTemplate]
LocFriendlyName="Fire Storm"
LocLongDescription="Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position."
LocHelpText="Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position."
LocFlyOverText="Fire Storm"
LocPromotionPopupText="<Bullet/>Use the <Ability:WeaponName/> to attack all units in a complete circle around the <Ability:ClassName/>'s position.<br/><Bullet/>Costs <Ability:CHEMSTORM_AMMO/> Ammo.<br/><Bullet/>Has a <Ability:CHEMSTORM_COOL/> round cooldown.<br/><Bullet/>Has a range of <Ability:CHEMSTORM_RADIUS/> tiles."

[MZCorrodingCompounds X2AbilityTemplate]
LocFriendlyName="Corroding Compounds"
LocLongDescription="Chemthrower attacks pierce and shred a small amount of armour."
LocHelpText="Chemthrower attacks pierce and shred a small amount of armour."
LocFlyOverText="Corroding Compounds"
LocPromotionPopupText="<Bullet/>Chemthrower attacks pierce and shred a small amount of armour.<br/><Bullet/>Corroding pierces <Ability:CORCOM_PIERCE/> armour and also shreds <Ability:CORCOM_SHRED/> armour."

[MZDesolateHomeland X2AbilityTemplate]
LocFriendlyName="Desolate Homeland"
LocLongDescription="While standing in an enviromental effect, become immune to mental effects and gain damage reduction based on chemthrower tech level."
LocHelpText="While standing in an enviromental effect, become immune to mental effects and gain damage reduction based on chemthrower tech level."
LocFlyOverText="Desolate Homeland"
LocPromotionPopupText="<Bullet/>Grants immunity to Mental, Panic, Stun, Disorient, and Unconcious while standing in an enviromental hazard.<br/><Bullet/>Enviromental hazards include Smoke, Poison, Acid, Fire and Curse.<br/><Bullet/>If a chemthrower is equipped gain damage reduction based on the tech level of the chemthrower."

[MZDissonantEnergies X2AbilityTemplate]
LocFriendlyName="Dissonant Energies"
LocLongDescription="Electric attacks do bonus damage to cursed, blinded, confused or panicking targets. Psionic attacks do bonus damage to stunned, disorient or dazed targets."
LocHelpText="Electric attacks do bonus damage to cursed, blinded, or panicking targets. Psionic attacks do bonus damage to stunned, disorient or dazed targets."
LocFlyOverText="Dissonant Energies"
LocPromotionPopupText="<Bullet/>Electric attacks do bonus damage to cursed, blinded, confused or panicking targets.<br/><Bullet/>Psionic attacks do bonus damage to stunned, disorient or dazed targets.<br/><Bullet/>This bonus is also granted against foes immune to the opposing element.<br/><Bullet/>Bonus damage amount is +<Ability:DISSONANTENERGIES_BONUS/> ."

[MZExpandedCanister X2AbilityTemplate]
LocFriendlyName="Expanded Canister"
LocLongDescription="Increase the number of times a canister's ability can be activated."
LocHelpText="Increase the number of times a canister's ability can be activated."
LocFlyOverText="Expanded Canister"
LocPromotionPopupText="<Bullet/>Grants <Ability:EXPANDEDCANISTER_CHARGES> bonus uses to the ability the canister grants the <Ability:ClassName/>'s Chemthrower.<br/><Bullet/>The medical canister also grants <Ability:EXPANDEDCANISTER_MEDICCHARGES> additional uses of Medispray."

[MZFineControl X2AbilityTemplate]
LocFriendlyName="Fine Control"
LocLongDescription="Superior handling prevents hitting unintended targets with your chemthrower abilities."
LocHelpText="Superior handling prevents hitting unintended targets with your chemthrower abilities."
LocFlyOverText="Fine Control"
LocPromotionPopupText="<Bullet/>Superior handling prevents hitting friendly targets with your offensive chemthrower abilities.<br/><Bullet/>Will also prevent medispray and fumigate from affecting enemies."

[MZFulmination X2AbilityTemplate]
LocFriendlyName="Fulmination"
LocLongDescription="Explosive Chemthrower blast that causes any other explosives in the vicinity to detonate."
LocHelpText="Explosive Chemthrower blast that causes any other explosives in the vicinity to detonate."
LocFlyOverText="Fulmination"
LocPromotionPopupText="<Bullet/>Special Chemthrower blast deals explosive damage, regardless of what kind of chemthrower used.<br/><Bullet/> Deals <Ability:MZCanisterDamage/> of the <Ability:WeaponName/>'s base damage as Explosive damage.<br/><Bullet/>Detonates explosives carried by enemies.<br/><Bullet/>Detonates explosive enviromental objects, like cars and fuel tanks.<br/><Bullet/>Fulmination uses <Ability:FULMINATION_AMMO/> ammo.<br/><Bullet/>Fulmination has a <Ability:FULMINATION_COOL/> turn cooldown."

[MZFumigate X2AbilityTemplate]
LocFriendlyName="Fumigate"
LocLongDescription="Spray cleansing chemicals, removing enviromental ailments from targets in a cone."
LocHelpText="Spray cleansing compounds, removing enviromental status effects from targets in a cone."
LocFlyOverText="Fumigate"
LocPromotionPopupText="<Bullet/>Spray cleansing chemicals, removing enviromental ailments from targets in a cone.<br/><Bullet/>Fumigate uses <Ability:FUMIGATE_AMMO/> ammo and <Ability:FUMIGATE_CONSUMEALL/> turn ending.<br/><br/><Bullet/>If the <Ability:ClassName/> also has 'Smells Like Team Spirit' Fumigate removes mental afflictions.<br/><Bullet>If the <Ability:ClassName/> also has 'Thermal Bulwark' the effects apply to Fumigate Targets with a <Ability:FUMIGATE_BULWARK/>% chance to deflect attacks."

[MZIncandescence X2AbilityTemplate]
LocFriendlyName="Incandescance"
LocLongDescription="Chemthrower attacks illuminate foes, making them easier for allies to crit."
LocHelpText="Chemthrower attacks illuminate foes, making them easier for allies to crit."
LocFlyOverText="Incandescance"
LocPromotionPopupText="<Bullet/>Chemthrower attacks illuminate foes, making them easier for allies to crit.<br/><Bullet/>The effect lasts for <Ability:INCAN_DURATION/> rounds.<br/><Bullet/>Gives allies a <Ability:INCAN_CRIT/>% crit chance bonus."

[MZMedispray X2AbilityTemplate]
LocFriendlyName="Medispray"
LocLongDescription="Spray regenerative chemicals, healing targets in a cone. Gains additional charges for each medikit."
LocHelpText="Spray regenerative chemicals, healing targets in a cone."
LocFlyOverText="Medispray"
LocPromotionPopupText="<Bullet/>Spray regenerative chemicals, healing targets in a cone.<br/><Bullet/>Has <Ability:MEDISPRAY_CHARGES/> charge per mission and <Ability:MEDISPRAY_CONSUMEALL/> turn ending.<br/><Bullet/>Gains additional charges for each medikit carried and is also affected by Field Medic.<br/><br/><Bullet/>If the <Ability:ClassName/> also has 'Smells Like Team Spirit' gains <Ability:MEDISPRAY_CHARGES_SPIRIT/> additional charges.<br/><Bullet>If the <Ability:ClassName/> also has 'Thermal Bulwark' the effects apply to Medispray Targets with a <Ability:FUMIGATE_BULWARK/>% chance to deflect attacks, but only if the unit was actually healed."

[MZNightmareFuel X2AbilityTemplate]
LocFriendlyName="Nightmare Fuel"
LocLongDescription="Chemthrower attacks have a chance to cause panic."
LocHelpText="Chemthrower attacks have a chance to cause panic."
LocFlyOverText="Nightmare Fuel"
LocPromotionPopupText="<Bullet/>Chemthrower attacks have a chance to cause panic.<br/><Bullet/>Has a <Ability:NIGHTFUEL_CHANCE/>% chance to panic."

[MZOppressiveHeat X2AbilityTemplate]
LocFriendlyName="Oppressive Heat"
LocLongDescription="Pressure Blast, Chemthrower Suppression and Overwatch disorient foes."
LocHelpText="Pressure Blast, Chemthrower Suppression and Overwatch disorient foes."
LocFlyOverText="Oppressive Heat"
LocPromotionPopupText="<Bullet/>Pressure Blast disorients all targets it hits.<br/><Bullet/>Overwatch shots disorient the primary target if it hits.<br/><Bullet/>Suppression disorients secondary targets immediatly, and the primary target if the suppression shot hits."

[MZParticulateHaze X2AbilityTemplate]
LocFriendlyName="Particulate Haze"
LocLongDescription="Chemthrower attacks additionaly blind targets."
LocHelpText="Chemthrower attacks additionaly blind targets."
LocFlyOverText="Particulate Haze"
LocPromotionPopupText="<Bullet/>Chemthrower attacks additionally blind targets.<br/><Bullet/>The effect lasts for <Ability:PARHAZE_DURATION/> rounds."

[MZPressureBlast X2AbilityTemplate]
LocFriendlyName="Pressure Blast"
LocLongDescription="Expel a high pressure blast from the chemthrower that damages and knocks back everything in a cone."
LocHelpText="Expel a high pressure blast from the chemthrower that damages and knocks back everything in a cone."
LocFlyOverText="Pressure Blast"
LocPromotionPopupText="<Bullet/>Knocks back enemies up to <Ability:PRESSUREBLAST_KNOCKBACK/> meters.<br/><Bullet/>This attack is <Ability:PRESSUREBLAST_CRIT>% more likely to result in a critical hit.<br/><Bullet/> Deals <Ability:MZCanisterDamage/> increased base damage.<br/><Bullet/>Costs <Ability:PRESSUREBLAST_AMMO/> Ammo.<br/><Bullet/>Has a <Ability:PRESSUREBLAST_COOL/> round cooldown."

[MZRoaringFlames X2AbilityTemplate]
LocFriendlyName="Roaring Flames"
LocLongDescription="Chemthrower reaction fire has a <Ability:ROARINGFLAMES_CRIT/>% increased chance to crit."
LocHelpText="Chemthrower reaction fire has a <Ability:ROARINGFLAMES_CRIT/>% increased chance to crit."
LocFlyOverText="Roaring Flames"
LocPromotionPopupText="<Bullet/>Enables all reaction fire by this soldier to crit if they have a chemthrower equipped.<br/><Bullet/>Chemthrower reaction fire gains <Ability:ROARINGFLAMES_CRIT/>% critical chance."

[MZRovingChemist X2AbilityTemplate]
LocFriendlyName="Roving Chemist"
LocLongDescription="Gain a momentum action point after activating a Canister's special ability."
LocHelpText="Gain a momentum action point after activating a Canister's special ability."
LocFlyOverText="Roving Chemist"
LocPromotionPopupText="<Bullet/>Gain a momentum action point after activating a Canister's special ability.<br/><Bullet/> Can be used to move into a more opportune location, such as into the smoke from a Smoke Canister."

[MZSearingMagnesium X2AbilityTemplate]
LocFriendlyName="Searing Magnesium"
LocLongDescription="Chemthrower attacks deal additional damage on a critical hit."
LocHelpText="Chemthrower attacks deal additional damage on a critical hit."
LocFlyOverText="Searing Magnesium"
LocPromotionPopupText="<Bullet/>Chemthrower attacks deal additional damage on a critical hit."

[MZSmellsLikeTeamSpirit X2AbilityTemplate]
LocFriendlyName="Smells Like Team Spirit"
LocLongDescription="Fumigate additionaly removes mental ailments. Medispray gains an additional charge."
LocHelpText="Fumigate additionaly removes mental ailments. Medispray gains an additional charge."
LocFlyOverText="Smells Like Team Spirit"
LocPromotionPopupText="<Bullet/>Fumigate additionally removes mental ailments.<br/><Bullet/>Medispray gains <Ability:MEDISPRAY_CHARGES_SPIRIT/> additional charges."

[MZSpecializedCounteragent X2AbilityTemplate]
LocFriendlyName="Specialized Counteragent"
LocLongDescription="Canister's bonus ability does more damage to targets immune to the Chemthrower's normal damage type."
LocHelpText="Canister's bonus ability does more damage to targets immune to the Chemthrower's normal damage type."
LocFlyOverText="Specialized Counteragent"
LocPromotionPopupText="<Bullet/>Bonus granted when the target is immune to the equipped Chemthrower's normal damage type.<br/><Bullet/>The ability use must be able to damage the target in order to recieve a bonus.<br/><Bullet/>Fulmination can also benefit, because it always does explosive damage.<br/><Bullet/>The damage bonus is +<Ability:COUNTERAGENT_BONUS>."

[MZThermalBulwark X2AbilityTemplate]
LocFriendlyName="Thermal Bulwark"
LocLongDescription="Activating a Chemthrower ability grants a chance to deflect incoming attacks. Fumigate and Medispray also apply this effect to thier targets."
LocHelpText="Activating a Chemthrower ability grants a chance to deflect incoming attacks."
LocFlyOverText="Thermal Bulwark"
LocPromotionPopupText="<Bullet/>Activating a Chemthrower ability grants a <Ability:THERMBULWARK_CHANCE/>% chance to deflect incoming attacks.<br/><Bullet/>Fumigate and Medispray also apply this effect to thier targets with a <Ability:FUMIGATE_BULWARK/>% chance to deflect attacks.<br/><Bullet> Only Medispray targets that are actually healed gain the bonus."

[MZThermalBulwarkTrigger X2AbilityTemplate]
LocFriendlyName="Thermal Bulwark"
LocLongDescription="<Bullet/><Ability:THERMBULWARK_CHANCE/>% chance to deflect incoming attacks."
LocHelpText="<Bullet/><Ability:THERMBULWARK_CHANCE/>% chance to deflect incoming attacks."
LocFlyOverText="Thermal Bulwark"

[MZThermalShock X2AbilityTemplate]
LocFriendlyName="Thermal Shock"
LocLongDescription="Cold attacks do bonus damage to burning targets. Fire attacks do bonus damage to chilled or frozen targets."
LocHelpText="Cold attacks do bonus damage to burning targets. Fire attacks do bonus damage to chilled or frozen targets."
LocFlyOverText="Thermal Shock"
LocPromotionPopupText="<Bullet/>Cold attacks do bonus damage to burning targets.<br/><Bullet/>Fire attacks do bonus damage to chilled or frozen targets.<br/><Bullet/>This bonus is also granted against foes immune to the opposing element.<br/><Bullet/>Bonus damage amount is +<Ability:THERMSHOCK_BONUS/> ."

[MZUnstableReaction X2AbilityTemplate]
LocFriendlyName="Unstable Reaction"
LocLongDescription="Acid attacks do bonus damage to poisoned targets. Poison attacks do bonus damage to acid burning targets."
LocHelpText="Acid attacks do bonus damage to poisoned targets. Poison attacks do bonus damage to acid burning targets."
LocFlyOverText="Unstable Reaction"
LocPromotionPopupText="<Bullet/>Acid attacks do bonus damage to poisoned or zombified targets.<br/><Bullet/>Poison attacks do bonus damage to acid burning targets.<br/><Bullet/>This bonus is also granted against foes immune to the opposing element.<br/><Bullet/>Bonus damage amount is +<Ability:UNSTABLEREACTION_BONUS/> ."

[MZViscousAccelerant X2AbilityTemplate]
LocFriendlyName="Viscous Accelerant"
LocLongDescription="Chemthrower attacks apply a stacking debuff that increases damage from all damage over time effects."
LocHelpText="Chemthrower attacks apply a stacking debuff that increases damage from all damage over time effects."
LocFlyOverText="Viscous Accelerant"
LocPromotionPopupText="<Bullet/>Chemthrower attacks apply a stacking debuff that increases damage from all 'damage over time' effects.<br/><Bullet/>The effect lasts for <Ability:VISC_DURATION/> rounds.<br/><Bullet/>The bonus damage is +<Ability:VISC_BONUS/> ."

[MZImmolator_CV X2WeaponTemplate]
FriendlyName="Immolator"
FriendlyNamePlural="Immolators"
BriefSummary="This basic chemical thrower fires a stream of highly flamable chemicals, burning and damaging multiple targets."
TacticalText="<Bullet/> Chemthrowers do low damage in a wide area, making them effective only when dealing with multiple targets.<br> <Bullet/> The Immolator will always burn targets, dealing damage over time and disabling some abilities.<br> <Bullet/> Some enemies may be immune to fire, and take no damage from the immolator.<br> <Bullet/> Extremely effective against the Lost.<br>"
AbilityDescName="Immolator"

[MZImmolator_MG X2WeaponTemplate]
FriendlyName="Advanced Immolator"
FriendlyNamePlural="Advanced Immolators"
BriefSummary="This basic chemical thrower fires a stream of highly flamable chemicals, burning and damaging multiple targets."
TacticalText="<Bullet/> Chemthrowers do low damage in a wide area, making them effective only when dealing with multiple targets.<br> <Bullet/> The Immolator will always burn targets, dealing damage over time and disabling some abilities.<br> <Bullet/> Some enemies may be immune to fire, and take no damage from the immolator.<br> <Bullet/> Extremely effective against the Lost.<br>"
AbilityDescName="Immolator"

[MZImmolator_BM X2WeaponTemplate]
FriendlyName="Superior Immolator"
FriendlyNamePlural="Superior Immolators"
BriefSummary="This basic chemical thrower fires a stream of highly flamable chemicals, burning and damaging multiple targets."
TacticalText="<Bullet/> Chemthrowers do low damage in a wide area, making them effective only when dealing with multiple targets.<br> <Bullet/> The Immolator will always burn targets, dealing damage over time and disabling some abilities.<br> <Bullet/> Some enemies may be immune to fire, and take no damage from the immolator.<br> <Bullet/> Extremely effective against the Lost.<br>"
AbilityDescName="Immolator"




[BreakthroughChemthrowerDamage X2TechTemplate]
DisplayName="Improved Chemthrowers"
Summary="By increasing the pressure of the fuel tanks in our Chemthrowers, we were able to improve damage output by +1."

[BreakthroughChemthrowerWeaponUpgrade X2TechTemplate]
DisplayName="Modular Chemthrowers"
Summary="Our breakthrough has allowed us to add an additional upgrade slot to all Chemthrowers without sacrificing balance or firepower."

[CraftChemthrowerUpgradeBsc X2TechTemplate]
DisplayName="Forge Basic Chemthrower Upgrade"
Summary="We can manufacture basic Chemthrower upgrades for a small cost."
[CraftChemthrowerUpgradeAdv X2TechTemplate]
DisplayName="Forge Advanced Chemthrower Upgrade"
Summary="We can manufacture advanced Chemthrower upgrades, but they will take more resources and time than a basic one."
[CraftChemthrowerUpgradeSup X2TechTemplate]
DisplayName="Forge Superior Chemthrower Upgrade"
Summary="We can manufacture superior Chemthrower upgrades, but they will take a substantial investment."


;Attachments exclusive to chemthrowers.
[MZWidthNozzle_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Wide Angle Nozzle"
FriendlyNamePlural="Wide Angle Nozzles"
BriefSummary="Increase chemthrower cone end width by 2 tiles."
TinySummary="Increased Cone Width +2"
LootTooltip="This weapon upgrade will slightly increase the width of cone abilities of the chemthrower it is attached to."
[MZWidthNozzle_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Wide Angle Nozzle"
FriendlyNamePlural="Advanced Wide Angle Nozzles"
BriefSummary="Increase chemthrower cone end width by 3 tiles."
TinySummary="Increased Cone Width +3"
LootTooltip="This weapon upgrade will increase the width of cone abilities of the chemthrower it is attached to."
[MZWidthNozzle_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Wide Angle Nozzle"
FriendlyNamePlural="Superior Wide Angle Nozzles"
BriefSummary="Increase chemthrower cone end width by 4 tiles."
TinySummary="Increased Cone Width +4"
LootTooltip="This weapon upgrade will significantly increase the width of cone abilities of the chemthrower it is attached to."

[MZLengthNozzle_Bsc X2WeaponUpgradeTemplate]
FriendlyName="High Velocity Nozzle"
FriendlyNamePlural="High Velocity Nozzles"
BriefSummary="Increase chemthrower maximum range by 1 tile."
TinySummary="Increased Range +1"
LootTooltip="This weapon upgrade will slightly increase the maximum range of abilities of the chemthrower it is attached to."
[MZLengthNozzle_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced High Velocity Nozzle"
FriendlyNamePlural="Advanced High Velocity Nozzles"
BriefSummary="Increase chemthrower maximum range by 2 tiles."
TinySummary="Increased Range +2"
LootTooltip="This weapon upgrade will increase the maximum range of abilities of the chemthrower it is attached to."
[MZLengthNozzle_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior High Velocity Nozzle"
FriendlyNamePlural="Superior High Velocity Nozzles"
BriefSummary="Increase chemthrower maximum range by 3 tile."
TinySummary="Increased Range +3"
LootTooltip="This weapon upgrade will significantly increase the maximum range of abilities of the chemthrower it is attached to."

[MZClipSizeFuel_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Expanded Fuel Tank"
FriendlyNamePlural="Expanded Fuel Tanks"
BriefSummary="Clip size is increased by <Ability:EXPMAGINCREASE/>."
TinySummary="Increased Clip Size +<Ability:EXPMAGINCREASE/>"
LootTooltip="This chemthrower upgrade will slightly increase maximum ammo capacity."
[MZClipSizeFuel_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Expanded Fuel Tank"
FriendlyNamePlural="Advanced Expanded Fuel Tanks"
BriefSummary="Clip size is increased by <Ability:EXPMAGINCREASE/>."
TinySummary="Increased Clip Size +<Ability:EXPMAGINCREASE/>"
LootTooltip="This chemthrower upgrade will increase maximum ammo capacity.."
[MZClipSizeFuel_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Expanded Fuel Tank"
FriendlyNamePlural="Superior Expanded Fuel Tanks"
BriefSummary="Clip size is increased by <Ability:EXPMAGINCREASE/>."
TinySummary="Increased Clip Size +<Ability:EXPMAGINCREASE/>"
LootTooltip="This chemthrower upgrade will significantly increase maximum ammo capacity."

[MZReloadFuel_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Auto-Refueling Tank"
FriendlyNamePlural="Auto-Refueling Tanks"
BriefSummary="Auto reload 1 ammo per turn to a maximum of 4."
TinySummary="Auto reload 1 ammo per turn to a maximum of 4."
LootTooltip="This chemthrower upgrade provides auto reloading 1 ammo per turn to a maximum of 4."
[MZReloadFuel_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Auto-Refueling Tank"
FriendlyNamePlural="Advanced Auto-Refueling Tanks"
BriefSummary="Auto reload 1 ammo per turn to a maximum of 6."
TinySummary="Auto reload 1 ammo per turn to a maximum of 6."
LootTooltip="This chemthrower upgrade provides auto reloading 1 ammo per turn to a maximum of 6."
[MZReloadFuel_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Auto-Refueling Tank"
FriendlyNamePlural="Superior Auto-Refueling Tanks"
BriefSummary="Auto reload 1 ammo per turn to a maximum of 8."
TinySummary="Auto reload 1 ammo per turn to a maximum of 8."
LootTooltip="This chemthrower upgrade provides auto reloading 1 ammo per turn to a maximum of 8."

[MZFuelLine_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Fuel Line"
FriendlyNamePlural="Fuel Line"
BriefSummary="Increases Canister charges by 1."
TinySummary="Increases Canister charges by 1."
LootTooltip="This Chemthrower upgrade provides one additional use of the ability granted by a Canister."
[MZFuelLine_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Fuel Line"
FriendlyNamePlural="Advanced Fuel Lines"
BriefSummary="Increases Canister charges by 2."
TinySummary="Increases Canister charges by 2."
LootTooltip="This Chemthrower upgrade provides two additional uses of the ability granted by a Canister."
[MZFuelLine_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Fuel Line"
FriendlyNamePlural="Superior Fuel Lines"
BriefSummary="Increases Canister charges by 3."
TinySummary="Increases Canister charges by 3."
LootTooltip="This Chemthrower upgrade provides three additional uses of the ability granted by a Canister."

[MZReactionFireFrame_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Sentinel Frame"
FriendlyNamePlural="Sentinel Frames"
BriefSummary="You have +10 to hit on reaction fire shots."
TinySummary="You have +10 to hit on reaction fire shots."
LootTooltip="This chemthrower upgrade, when installed, increases your chance to hit by +10 on reaction fire shots."
[MZReactionFireFrame_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Sentinel Frame"
FriendlyNamePlural="Advanced Sentinel Frames"
BriefSummary="You have +15 to hit on reaction fire shots."
TinySummary="You have +15 to hit on reaction fire shots."
LootTooltip="This chemthrower upgrade, when installed, increases your chance to hit by +10 on reaction fire shots."
[MZReactionFireFrame_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Sentinel Frame"
FriendlyNamePlural="Superior Sentinel Frames"
BriefSummary="You have +20 to hit on reaction fire shots."
TinySummary="You have +20 to hit on reaction fire shots."
LootTooltip="This chemthrower upgrade, when installed, increases your chance to hit by +10 on reaction fire shots."

[MZReactionFireFrameBsc X2AbilityTemplate]
FriendlyName="Sentinel Frame"
[MZReactionFireFrameAdv X2AbilityTemplate]
FriendlyName="Sentinel Frame"
[MZReactionFireFrameSup X2AbilityTemplate]
FriendlyName="Sentinel Frame"

[MZFlankCritFrame_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Outrider Frame"
FriendlyNamePlural="Outrider Frames"
BriefSummary="You have +20 to crit on flanking shots or melee attacks."
TinySummary="You have +20 to crit on flanking shots or melee attacks."
LootTooltip="This chemthrower upgrade, when installed, increases your chance to crit by +20 on flanking or melee attacks."
[MZFlankCritFrame_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Outrider Frame"
FriendlyNamePlural="Advanced Outrider Frames"
BriefSummary="You have +30 to crit on flanking shots or melee attacks."
TinySummary="You have +30 to crit on flanking shots or melee attacks."
LootTooltip="This chemthrower upgrade, when installed, increases your chance to crit by +30 on flanking or melee attacks."
[MZFlankCritFrame_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Outrider Frame"
FriendlyNamePlural="Superior Outrider Frames"
BriefSummary="You have +40 to crit on flanking shots or melee attacks."
TinySummary="You have +40 to crit on flanking shots or melee attacks."
LootTooltip="This chemthrower upgrade, when installed, increases your chance to crit by +40 on flanking or melee attacks."

[MZFlankCritFrameBsc X2AbilityTemplate]
FriendlyName="Outrider Frame"
[MZFlankCritFrameAdv X2AbilityTemplate]
FriendlyName="Outrider Frame"
[MZFlankCritFrameSup X2AbilityTemplate]
FriendlyName="Outrider Frame"

[MZBlastCanister X2WeaponTemplate]
FriendlyName="Blast Canister"
FriendlyNamePlural="Blast Canisters"
BriefSummary="This basic Canister enables the soldier to use an alternative explosive attack with thier Chemthrower."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/> Grants <Ability:BLASTCANISTER_USES> uses of an explosive chemthrower attack.<br/><Bullet/> Deals <Ability:MZCanisterDamage-MZBlastCanisterActivate/> of the Chemthrower's base damage as Explosive damage.<br><Bullet/> The explosive attack this Canister provides is useful against enemies immune to fire.<br><Bullet/> If equipped with an explosive chemthrower, the chemthrower will do +<Ability:MATCHINGCANISTER_BONUS> bonus damage on direct attacks."
AbilityDescName="Canister"
[MZBlastCanister X2AbilityTemplate]
LocFriendlyName="Activate Blast Canister"
LocLongDescription="Activate to expel a stream of explosive compounds in a cone with your chemthrower. Useful when targets are resistant to chemthrower's damage type."
LocHelpText="Activate to expel a stream of explosive compounds in a cone with your chemthrower. Useful when targets are resistant to chemthrower's damage type."
LocFlyOverText="Activate Blast Canister"
[MZBlastCanisterActivate X2AbilityTemplate]
LocFriendlyName="Activate Blast Canister"
LocLongDescription="Activate to expel a stream of explosive compounds in a cone with your chemthrower. Useful when targets are resistant to chemthrower's damage type."
LocHelpText="Activate to expel a stream of explosive compounds in a cone with your chemthrower. Useful when targets are resistant to chemthrower's damage type."
LocFlyOverText="Activate Blast Canister"

;

[MZFireCanister X2WeaponTemplate]
FriendlyName="Flame Canister"
FriendlyNamePlural="Flame Canisters"
BriefSummary="This Canister enables the soldier to use an alternative fire attack with thier Chemthrower."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/> Grants <Ability:FIRECANISTER_USES> uses of an fiery chemthrower attack.<br/><Bullet/> Deals <Ability:MZCanisterDamage-MZFireCanisterActivate/> of the Chemthrower's base damage as Fire damage.<br><Bullet/> This sets enemies on fire, limiting the abilites they can use and doing damage over time.<br><Bullet/> If equipped with a fire chemthrower, the chemthrower will do +<Ability:MATCHINGCANISTER_BONUS> bonus damage on direct attacks."
AbilityDescName="Canister"
[MZFireCanister X2AbilityTemplate]
LocFriendlyName="Activate Flame Canister"
LocLongDescription="Activate to expel a stream of highly flammable compounds in a cone with your chemthrower. Inflicts burning and fire damage."
LocHelpText="Activate to expel a stream of highly flammable compounds in a cone with your chemthrower. Inflicts burning and fire damage."
LocFlyOverText="Activate Flame Canister"
[MZFireCanisterActivate X2AbilityTemplate]
LocFriendlyName="Activate Flame Canister"
LocLongDescription="Activate to expel a stream of highly flammable compounds in a cone with your chemthrower. Inflicts burning and fire damage."
LocHelpText="Activate to expel a stream of highly flammable compounds in a cone with your chemthrower. Inflicts burning and fire damage."
LocFlyOverText="Activate Flame Canister"

[MZPoisonCanister X2WeaponTemplate]
FriendlyName="Toxic Gas Canister"
FriendlyNamePlural="Toxic Gas Canisters"
BriefSummary="This Canister enables the soldier to use an alternative poison attack with thier Chemthrower."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/>Grants <Ability:POISONCANISTER_USES> uses of a toxic gas chemthrower attack.<br/><Bullet/> Deals <Ability:MZCanisterDamage-MZPoisonCanisterActivate/> of the Chemthrower's base damage as Poison damage.<br><Bullet/> This bypasses shields and poisons enemies, impairing aim and mobility.<br><Bullet/> If equipped with a poison chemthrower, the chemthrower will do +<Ability:MATCHINGCANISTER_BONUS> bonus damage on direct attacks."
AbilityDescName="Canister"
[MZPoisonCanister X2AbilityTemplate]
LocFriendlyName="Activate Toxic Gas Canister"
LocLongDescription="Activate to expel a stream of toxic gas in a cone with your chemthrower. Inflicts poison and poison damage that bypasses shields."
LocHelpText="Activate to expel a stream of toxic gas in a cone with your chemthrower. Inflicts poison and poison damage that bypasses shields."
LocFlyOverText="Activate Toxic Gas Canister"
[MZPoisonCanisterActivate X2AbilityTemplate]
LocFriendlyName="Activate Toxic Gas Canister"
LocLongDescription="Activate to expel a stream of toxic gas in a cone with your chemthrower. Inflicts poison and poison damage that bypasses shields."
LocHelpText="Activate to expel a stream of toxic gas in a cone with your chemthrower. Inflicts poison and poison damage that bypasses shields."
LocFlyOverText="Activate Toxic Gas Canister"

[MZAcidCanister X2WeaponTemplate]
FriendlyName="Acid Canister"
FriendlyNamePlural="Acid Canisters"
BriefSummary="This Canister enables the soldier to use an alternative acid attack with thier Chemthrower."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/> Grants <Ability:ACIDCANISTER_USES> uses of an acidic chemthrower attack.<br/><Bullet/> Deals <Ability:MZCanisterDamage-MZAcidCanisterActivate/> of the Chemthrower's base damage as Acid damage.<br><Bullet/> This shreds armour and inflicts acid burning, dealing damage over time.<br><Bullet/> If equipped with a acid chemthrower, the chemthrower will do +<Ability:MATCHINGCANISTER_BONUS> bonus damage on direct attacks."
AbilityDescName="Canister"
[MZAcidCanister X2AbilityTemplate]
LocFriendlyName="Activate Acid Canister"
LocLongDescription="Activate to expel a stream of highly corrosive compounds in a cone with your chemthrower. Inflicts acid burning and acid damage that shreds armour."
LocHelpText="Activate to expel a stream of highly corrosive compounds in a cone with your chemthrower. Inflicts acid burning and acid that shreds armour."
LocFlyOverText="Activate Acid Canister"
[MZAcidCanisterActivate X2AbilityTemplate]
LocFriendlyName="Activate Acid Canister"
LocLongDescription="Activate to expel a stream of highly corrosive compounds in a cone with your chemthrower. Inflicts acid burning and acid damage that shreds armour."
LocHelpText="Activate to expel a stream of highly corrosive compounds in a cone with your chemthrower. Inflicts acid burning and acid that shreds armour."
LocFlyOverText="Activate Acid Canister"

[MZBluescreenCanister X2WeaponTemplate]
FriendlyName="Bluescreen Canister"
FriendlyNamePlural="Bluescreen Canisters"
BriefSummary="This Canister enables the soldier to use an alternative electrical attack with thier Chemthrower."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/> Grants <Ability:BLUESCREENCANISTER_USES> uses of an electrical chemthrower attack.<br/><Bullet/> Deals <Ability:MZCanisterDamage-MZBluescreenCanisterActivate/> of the Chemthrower's base damage as Electrical damage.<br><Bullet/> This attack stuns and ignores the armour of robotic fores.<br><Bullet/> Other foes are disoriented.<br><Bullet/> If equipped with an electric chemthrower, the chemthrower will do +<Ability:MATCHINGCANISTER_BONUS> bonus damage on direct attacks."
AbilityDescName="Canister"
[MZBluescreenCanister X2AbilityTemplate]
LocFriendlyName="Activate Bluescreen Canister"
LocLongDescription="Activate to expel a stream of magnetized particulate in a cone with your chemthrower. Inflicts armour piercing electrical damage and stun to robotics. Inflicts disorient and electric damage to other foes."
LocHelpText="Activate to expel a stream of magnetized particulate in a cone with your chemthrower. Inflicts armour piercing electrical damage and stun to robotics. Inflicts disorient and electric damage to other foes."
LocFlyOverText="Activate Bluescreen Canister"
[MZBluescreenCanisterActivate X2AbilityTemplate]
LocFriendlyName="Activate Bluescreen Canister"
LocLongDescription="Activate to expel a stream of magnetized particulate in a cone with your chemthrower. Inflicts armour piercing electrical damage and stun to robotics. Inflicts disorient and electric damage to other foes."
LocHelpText="Activate to expel a stream of magnetized particulate in a cone with your chemthrower. Inflicts armour piercing electrical damage and stun to robotics. Inflicts disorient and electric damage to other foes."
LocFlyOverText="Activate Bluescreen Canister"

[MZCurseCanister X2WeaponTemplate]
FriendlyName="Curse Canister"
FriendlyNamePlural="Curse Canisters"
BriefSummary="This Canister enables the soldier to use an alternative psionic attack with thier Chemthrower."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/> Grants <Ability:CURSECANISTER_USES> uses of a psionic chemthrower attack.<br/><Bullet/> Deals <Ability:MZCanisterDamage-MZCurseCanisterActivate/> of the Chemthrower's base damage as Psi damage.<br><Bullet/> This inflicts blood curse, dealing damage over time and reducing mental stats.<br><Bullet/> Enemies killed by this can't be saved by sustain effects.<br><Bullet/> If equipped with a psionic chemthrower, the chemthrower will do +<Ability:MATCHINGCANISTER_BONUS> bonus damage on direct attacks."
AbilityDescName="Canister"
[MZCurseCanister X2AbilityTemplate]
LocFriendlyName="Activate Curse Canister"
LocLongDescription="Activate to expel a malevolent curse in a cone with your chemthrower. Inflicts blood curse and psionic damage that bypasses Sustain effects."
LocHelpText="Activate to expel a malevolent curse in a cone with your chemthrower. Inflicts blood curse and psionic damage that bypasses Sustain effects."
LocFlyOverText="Activate Curse Canister"
[MZCurseCanisterActivate X2AbilityTemplate]
LocFriendlyName="Activate Curse Canister"
LocLongDescription="Activate to expel a malevolent curse in a cone with your chemthrower. Inflicts blood curse and psionic damage that bypasses Sustain effects."
LocHelpText="Activate to expel a malevolent curse in a cone with your chemthrower. Inflicts blood curse and psionic damage that bypasses Sustain effects."
LocFlyOverText="Activate Curse Canister"

[MZSmokeCanister X2WeaponTemplate]
FriendlyName="Smoke Canister"
FriendlyNamePlural="Smoke Canisters"
BriefSummary="This basic Canister enables the soldier to use an alternative smoke generating ability with thier Chemthrower."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/> Grants <Ability:SMOKECANISTER_USES> uses of a smoke generating ability.<br><Bullet/> This provides the same defensive benefits as smoke grenades in a cone."
AbilityDescName="Canister"
[MZSmokeCanister X2AbilityTemplate]
LocFriendlyName="Activate Smoke Canister"
LocLongDescription="Activate to expel a stream of smoke in a cone with your chemthrower. Boosts defense of units standing in the smoke."
LocHelpText="Activate to expel a stream of smoke in a cone with your chemthrower. Boosts defense of units standing in the smoke."
LocFlyOverText="Activate Smoke Canister"
[MZSmokeCanisterActivate X2AbilityTemplate]
LocFriendlyName="Activate Smoke Canister"
LocLongDescription="Activate to expel a stream of smoke in a cone with your chemthrower. Boosts defense of units standing in the smoke."
LocHelpText="Activate to expel a stream of smoke in a cone with your chemthrower. Boosts defense of units standing in the smoke."
LocFlyOverText="Activate Smoke Canister"

[MZMedicCanister X2WeaponTemplate]
FriendlyName="Medical Canister"
FriendlyNamePlural="Medical Canisters"
BriefSummary="This Canister is an upgraded version of the Smoke Canister, providing additional health regen for the soldier and anyone the smoke is applied to."
TacticalText="<Bullet/> Canisters can only be used alongside Chemthrowers.<br><Bullet/> Grants <Ability:SMOKECANISTER_USES> uses of a smoke generating ability.<br><Bullet/> This provides the same defensive benefits as smoke grenades in a cone.<br><Bullet/> The soldier will passively regenrate health over time. <br><Bullet/> Targets effected by the smoke ability, Fumigate or Medispray also benefit from this regen temporarily.<br><Bullet/> Additional provides <Ability:MEDICCANISTER_USES> additional Medispray charges, if the ability has been learned."
AbilityDescName="Canister"
[MZMedicCanisterPassive X2AbilityTemplate]
LocFriendlyName="Medical Canister"
LocLongDescription="The Medical Canister provides additional health regen for the soldier and anyone the smoke is applied to."
LocHelpText="The Medical Canister provides additional health regen for the soldier and anyone the smoke is applied to."
LocFlyOverText="Medical Canister"